% Αυτή η συνάρτηση παίρνει έναν πίνακα DxN από N σημεία δεδομένων σε 
% D-διάστατο χώρο και επιστρέφει τη σταθερά κανονικοποίησης της ελαχιστοποίησης L1/Lq
% Y: Πίνακας δεδομένων DxN
% lambda: παράμετρος κανονικοποίησης του lambda*||C||_{1,q} + 0.5 ||Y-YC||_F^2

function lambda = computeLambda_mat(Y,affine)

[~,N] = size(Y);% Προσδιορισμός του αριθμού των στηλών του Y (N σημεία δεδομένων)

if (~affine)% Έλεγχος αν το πρόβλημα είναι affine
    T = zeros(N,1);% Δημιουργία μηδενικού διανύσματος T μήκους N
    for i = 1:N
        yi = Y(:,i);% Επιλογή της i-στής στήλης του Y
        T(i) = norm(yi' * Y);% Υπολογισμός του γινομένου του yi με το Y και της νόρμας του
    end
    lambda = max(T);% Επιλογή της μέγιστης τιμής του T ως lambda
else
    T = zeros(N,1);% Δημιουργία μηδενικού διανύσματος T μήκους N
    for i = 1:N
        yi = Y(:,i);% Επιλογή της i-στής στήλης του Y
        ymean = mean(Y,2);% Υπολογισμός του μέσου όρου κάθε γραμμής του Y
        T(i) = norm(yi'*(ymean*ones(1,N)-Y));% Υπολογισμός της νόρμας της διαφοράς μεταξύ yi και Y
    end
    lambda = max(T);% Επιλογή της μέγιστης τιμής του T ως lambda
end
