% Αυτή η συνάρτηση λαμβάνει τον πίνακα συντελεστών υπολογίζει τους δείκτες των μη μηδενικών γραμμών
% C: Πίνακας συντελεστών NxN
% thr: Όριο για την επιλογή των μη μηδενικών γραμμών του C, τυπικά στο [0.9, 0.99]
% q: Τιμή του q στο πρόγραμμα ελαχιστοποίησης L1/Lq, από το σύνολο {1,2,inf}
function cssInd = findRep(C,thr,q)
% Ορισμός προεπιλεγμένων τιμών για τις παραμέτρους αν δεν έχουν δοθεί
if (nargin < 4)
    q = 2;% Προεπιλεγμένη τιμή για τη νόρμα Lq
end
if (nargin < 3)
    thr = 0.9;% Προεπιλεγμένο όριο για την επιλογή μη μηδενικών γραμμών
end

N = size(C,1);% Πλήθος γραμμών του πίνακα C

r = zeros(1,N);% Αρχικοποίηση πίνακα
for i = 1:N
    r(i) = norm(C(i,:),q);% Υπολογισμός της νόρμας Lq για κάθε γραμμή του C
end
[nrm,nrmInd] = sort(r,'descend');% Ταξινόμηση των νόρμων κατά φθίνουσα σειρά
nrmSum = 0;
for j = 1:N
    nrmSum = nrmSum + nrm(j);% Προσθήκη της τρέχουσας νόρμας στο άθροισμα
    % Έλεγχος αν το αθροιστικό ποσοστό των νόρμων υπερβαίνει το όριο thr
    if (nrmSum / sum(nrm) > thr)
        break;% Σταματά όταν το όριο επιτευχθεί
    end
end
cssInd = nrmInd(1:j);% Επιστροφή των δεικτών των μη μηδενικών γραμμών