% Αυτή η συνάρτηση λαμβάνει τον πίνακα δεδομένων και τους δείκτες των 
% αντιπροσώπων και αφαιρεί τους αντιπροσώπους που είναι πολύ κοντά μεταξύ τους
% Y: Πίνακας δεδομένων DxN με N σημεία δεδομένων σε D-διάστατο χώρο
% sInd: Δείκτες των αντιπροσώπων
function ind = rmRep(sInd,Y,thr)
% Ορισμός προεπιλεγμένου ορίου αν δεν έχει δοθεί από το χρήστη
if (nargin < 3)
    thr = 0.95;% thr: όριο για την αραίωση των αντιπροσώπων
end
% Επιλογή από τον πίνακα δεδομένων Y τα δεδομένα χρησιμοποιώντας τους δείκτες των αντιπροσώπων
Ys = Y(:,sInd);
Ns = size(Ys,2);% Αριθμός αντιπροσώπων
d = zeros(Ns,Ns);% Αρχικοποίηση πίνακα αποστάσεων
% Υπολογισμός της απόστασης μεταξύ κάθε ζεύγους αντιπροσώπων
for i = 1:Ns-1
    for j = i+1:Ns
        d(i,j) = norm(Ys(:,i) - Ys(:,j));% Ευκλείδεια απόσταση μεταξύ αντιπροσώπων
    end
end
d = d + d';% Ο πίνακας αποστάσεων γίνεται συμμετρικός
[dsort,dsorti] = sort(d,'descend');% Ταξινόμηση των αποστάσεων σε φθίνουσα σειρά

pind = 1:Ns;% Αρχικοποίηση του πίνακα δεικτών
for i = 1:Ns
    if (~isempty(find(pind==i,1)));% Έλεγχος αν ο αντιπρόσωπος i εξακολουθεί να περιλαμβάνεται στους ενεργούς δείκτες
        cum = 0;% Αρχικοποίηση αθροίσματος αποστάσεων
        t = 0;% Μετρητής για την εύρεση αποστάσεων πάνω από το όριο
        while (cum <= thr * sum(dsort(:,i)))
            t = t + 1;
            cum = cum + dsort(t,i);
        end
        % Αφαίρεση των πολύ κοντινών αντιπροσώπων από τη λίστα των ενεργών δεικτών
        pind = setdiff(pind,setdiff(dsorti(t:end,i),1:i));
    end
end
% Επιστροφή των τελικών δεικτών των αντιπροσώπων μετά την αραίωση
ind = sInd(pind);