% Αυτή η συνάρτηση λαμβάνει τον πίνακα συντελεστών C:NxN και πραγματοποιεί 
% συρρίκνωση για την ελαχιστοποίηση του lambda*||Z||_{1,q} + 0.5 ||C-Z||_F^2
% C: Πίνακας συντελεστών NxN, lambda: παράμετρος κανονικοποίησης, q: τιμή της νόρμας Lq για την ελαχιστοποίηση L1/Lq
function C2 = shrinkL1Lq(C1,lambda,q)
% Προσδιορισμός των διαστάσεων του πίνακα συντελεστών C1
[D,N] = size(C1);
% Έλεγχος για την περίπτωση q = 1, εφαρμόζεται L1-norm
if (q == 1)
    % Εφαρμόζεται συρρίκνωση ανάλογα με τη L1-norm
    C2 = max(abs(C1)-lambda,0) .* sign(C1);
elseif (q == 2)% Έλεγχος για την περίπτωση q = 2, εφαρμόζεται L2-norm
    r = zeros(D,1);% Αρχικοποίηση του διανύσματος r
    for j = 1:D
        % Υπολογισμός της συρρίκνωσης βάσει της L2-norm για κάθε γραμμή
        r(j) = max(norm(C1(j,:))-lambda,0);
    end
    % Εφαρμογή της κανονικοποίησης και συρρίκνωσης
    C2 = repmat(r./(r+lambda),1,N) .* C1;
elseif(q == inf)% Έλεγχος για την περίπτωση q = inf, εφαρμόζεται Linf-norm
    C2 = zeros(N,N);% Αρχικοποίηση του πίνακα C2
    for j = 1:N
        % Εφαρμογή της συρρίκνωσης L2/L∞ για κάθε γραμμή
        C2(j,:) = L2_Linf_shrink(C1(j,:)',lambda)';
    end
end